{
  "en": {
    "mainEmbedTitle": "📜 Welcome to the Sol's RNG Communication rules channel!",
    "mainEmbedDescription": "**This is where all the rules enforced on our Discord server are listed. Please read and follow them to ensure a pleasant experience for everyone!**\n\nIf there is anything confusing, you can go to the channel <#1411590263033561128> to contact the server administrators and ask questions.\n\n**⚠️ Warning Point & Punishment System:**\n```\n• 1 Warning Point  = no punishment \n• 2 Warning Points = 1h Mute\n• 3 Warning Points = 12h Mute\n• 4 warning Points = 1d Mute\n• 5 warning Points = A ban\n• Warning Points expire after 30 days\n```\n-# Thank you for reading and following! We always strive to develop the most civilized and prosperous Sol's RNG community in Southeast Asia!",
    "menuPlaceholder": "Select rules you would like to see",
    "opt1Title": "1 Warning Rules",
    "opt1Desc": "*Flooding/Spamming*\nDescription: Messages that occupy a large portion of the screen or involve the excessive posting of irrelevant content.\n*Exceptions:* Informative messages\n(Additional 1 Hour mute)\n\n*Excessive Begging*\nDescription: Repeatedly asking for favors, items, roles, privileges, or other benefits in an annoying or disruptive manner.\n*Exceptions:* Jokingly begging\n\n*XP Farming*\nDescription: Sending messages solely to gain XP in the Arcane bot and disrupting the chat, while also being unfair to the legitimate users.\n(Additional 1 Hour mute)\n1st Offense = reminder\n2nd Offense = Reduce XP\n3rd Offense = Level Reset",
    "opt2Title": "Channel Misuses",
    "opt2Desc": "Channel misuses fall under the 1 Warning Rules category, meaning any kind of misuse will result in 1 warning. And possibly a blacklist.\n\n**Chatting Channel Misuse**\nDescription: Using the chatting channels for purposes other than chatting\nIncludes: Bot commands outside of the Bots channel.\n\n**Macro Channels Misuse**\nDescription: using channels in the macro category incorrectly.\n*1x Warn:* Reminder\n*2x Warn:* 1 Day Macro Channels Blacklist\n*3x Warn:* 1 Week Macro Channels Blacklist\n\n**Community Channels Misuse**\nDescription: Using the channels in the Community section for inappropriate purposes.\n*1x Warn:* Reminder\n*2x Warn:* 1 Day Misuse Channel Blacklist\n*3x Warn:* 1 Week Misuse Channel Blacklist\n\n**Voice Channel Misuse**\nDescription: Misusing / improperly utilizing the voice channels\n(Additional 1h Mute)",
    "opt3Title": "2 Warning Rules",
    "opt3Desc": "**Inappropriate/Suggestive Language**\nDescriptions: Implying/Referencing something inappropriate, offensive, or sexual.\nDepending on the severity, this can go up to 3 Warnings or fall into NSFW.\n\n**Toxicity**\nDescription: Engaging in disruptive behavior that can be seen as disrespectful or toxic in any way.\nExceptions: Harmless arguments, Disagreement about Sol’s RNG related topic, discussions, constructive criticism, debates, joking with consent\n\n**Advertising/Self Promotion**\nDescription: Promoting/Spreading one's media for self gain.\nExceptions: With permission",
    "opt4Title": "3 Warning Rules",
    "opt4Desc": "**Mod Bait**\nDescription: Sending messages that appear punishable to provoke a reaction, even though they do not violate rules.\n\n**Accusation w/o Evidence**\nDescription: Making statements or claims about an individual wrongfully and without evidence to put them in a compromised situation\nDepending on the severity, this can lead to a ban.\n\n**DM Harassment**\nDescription: Harassing members via DM's due to having mutual access to the Sol's RNG Communication server\n\n**Discrimination**\nDescription: Harmful stereotyping based on someone’s race, gender, sexuality, religion, or any other personal characteristics.\nDepending on the severity of the discrimination, extreme/severe cases can fall under “Hate Speech.”",
    "opt5Title": "Instant Ban Rules",
    "opt5Desc": "*Punishment Evading*\nDescription: Leaving to avoid any punishment of any kind.\n\n*NSFW*\nDescription: Content that is inappropriate for any professional or public place, usually including nudity or suggestiveness of any kind.\n\n*Hate Speech/Racism*\nDescription: Any form of imagery / discussions that promotes extreme discrimination and hatred against individuals or groups based on their characteristics\n\n*Child Endangerment*\nDescription: Any act that puts minors at harm or inappropriate exposure.\n\n*Cybercrimes*\nDescription: Any form of illegal activity online\n\n*Inappropriate Profile*\nDescription: Using an inappropriate Discord profile picture, Discord display name, or Roblox username that contains offensive, suggestive, or explicit content.\n*Punishments:* Kick. If rejoined and unchanged, Ban"
  },
  "vi": {
    "mainEmbedTitle": "📜 Chào mừng đến kênh Rules của Sol's RNG!",
    "mainEmbedDescription": "**Đây là nơi liệt kê tất cả quy tắc trên server. Vui lòng đọc và tuân thủ!**\n\nNếu chưa rõ, liên hệ admin ở <#1411590263033561128>.\n\n**⚠️ Hệ thống Warning & Punishment:**\n```\n• 1 Warning Point = không phạt\n• 2 Warning Points = Mute 1h\n• 3 Warning Points = Mute 12h\n• 4 Warning Points = Mute 1d\n• 5 Warning Points = Ban\n• Warning Points hết hạn sau 30 ngày\n```\n-# Cảm ơn bạn đã đọc và tuân thủ! Chúng tôi luôn nỗ lực phát triển cộng đồng Sol's RNG văn minh và thịnh vượng nhất Đông Nam Á!",
    "menuPlaceholder": "Chọn quy tắc bạn muốn xem",
    "opt1Title": "1 Warning Rules",
    "opt1Desc": "*Spam/Flooding*\nTin nhắn chiếm màn hình hoặc đăng quá nhiều nội dung không liên quan.\nNgoại lệ: Tin nhắn thông tin\nMute 1h.\n\n*Xin xỏ quá mức*\nLiên tục xin vật phẩm, role, quyền lợi.\nNgoại lệ: Chỉ đùa vui.\n\n*Farm XP*\nGửi tin nhắn chỉ để lấy XP Arcane và phá chat.\n1st Offense: nhắc nhở\n2nd Offense: giảm XP\n3rd Offense: Reset Level",
    "opt2Title": "Channel Misuses",
    "opt2Desc": "Chatting Channel Misuse: Dùng sai mục đích.\nMacro Channels Misuse: Dùng sai mục đích.\nCommunity Channels Misuse: Dùng sai mục đích.\nVoice Channel Misuse: Dùng voice sai mục đích (Mute 1h).",
    "opt3Title": "2 Warning Rules",
    "opt3Desc": "Ngôn ngữ không phù hợp: Nội dung xúc phạm, khiêu gợi.\nToxicity: Hành vi gây rối.\nQuảng cáo/Self Promotion: Quảng bá cá nhân không được phép.",
    "opt4Title": "3 Warning Rules",
    "opt4Desc": "Mod Bait: Khiêu khích bằng tin nhắn vô hại.\nAccusation w/o Evidence: Tố cáo sai.\nDM Harassment: Quấy rối qua DM.\nDiscrimination: Phân biệt đối xử.",
    "opt5Title": "Instant Ban Rules",
    "opt5Desc": "Trốn phạt: Rời server để tránh phạt.\nNSFW: Nội dung gợi dục.\nHate Speech/Racism: Tăng hận thù.\nChild Endangerment: Gây hại trẻ em.\nCybercrimes: Hoạt động phạm pháp.\nProfile không phù hợp: Avatar, nickname hoặc Roblox username xúc phạm."
  }
}
